package level1;

public class CalculatorUserInput {
	public static void main(String[] args) {
		// - 유저에게 두 개의 숫자를 입력 받는다.
		// - 두 개의 숫자에 대해 덧셈이 가능하다.
		// - 두 개의 숫자에 대해 뺄셈이 가능하다.
		// - 두 개의 숫자에 대해 곱셈이 가능하다.
		// - 두 개의 숫자에 대해 나눗셈이 가능하다.
		// - "AC"를 입력 받으면 0으로 초기화하고 과정을 처음으로 돌아가 유저로 부터 입력을 다시 받는다.
		// - 계산 결과를 표현 할 때 소수점은 버리고 정수만 표현한다.
		// - 계산이 끝나도 프로그램은 종료 되지 않고 계속해서 프로그램으로서의 역할을 수행한다.
		// Optional: 계산 클래스를 생성하여 메인 코드에서 비즈니스 로직을 분리한다.
		// Optional: 출력 클래스를 생성하며 메인 코드에서 비즈니스 로직을 분리한다.
		// Optional: 유저의 입력을 검증하는 클래스를 생성하여 비즈니스 로직을 메인에서 분리한다.
		// Optional: 사칙연산을 한 번에 모두 실행해도 되지만 유저에게 어떤 계산을 할 건지 물어 볼 수도 있다.

	}
}
